<?php

return [
    'controllers' => [
        'userController' => [
            'get' => [
                'log' => 'Получение пользователя.'
            ],
            'read' => [
                'log' => 'Чтение пользователей.'
            ],
            'create' => [
                'log' => 'Создание пользователя.'
            ],
            'update' => [
                'log' => 'Обновление пользователя.'
            ],
            'password' => [
                'log' => 'Обновление пароля пользователя.'
            ],
            'destroy' => [
                'log' => 'Удаление пользователя.'
            ]
        ]
    ]
];
