<?php

return [
    'social' => [
        'log' => 'Авторизация через социальные сети.'
    ],
    'signIn' => [
        'log' => 'Пользователь авторизовался.'
    ],
    'signUp' => [
        'log' => 'Новый пользователь зарегестрировался.'
    ],
    'verified' => [
        'log' => 'Пользователь верефицировался.'
    ],
    'verify' => [
        'log' => 'Письмо для верификации было выслано.'
    ],
    'forget' => [
        'log' => 'Письмо для восстановления пароля было выслано.'
    ],
    'update' => [
        'log' => 'Обновление пользователя.'
    ],
    'password' => [
        'log' => 'Пароль был изменен пользователем.'
    ],
];
