<?php
return [

    /*
    |--------------------------------------------------------------------------
    | Драйвер работы с геокодированием
    |--------------------------------------------------------------------------
    |
    | Определяем систему получения геокодирования по умолчанию умолчанию. google - система
    | геокодирования на основе сервиса google.com
    |
    */

    'driver' => "google",

    'channels' => [
        'google' => [
            'key' => env('GOOGLE_MAP_KEY')
        ]
    ]
];
