<?php
return [

    /*
    |--------------------------------------------------------------------------
    | Драйвер отправки СМС сообщений
    |--------------------------------------------------------------------------
    |
    | Определяем систему отправки СМС сообщений умолчанию. center - система отправки
    | СМС сообщений через СмсЦентр - www.smsc.ru
    |
    */

    'driver' => env('SMS_DRIVER', 'log'),

    'center' => [
        'login' => "",
        'password' => ""
    ],
    'nexmo' => [
        'key' => env('SMS_NEXMO_KEY'),
        'secret' => env('SMS_NEXMO_SECRET')
    ]
];
