<?php
return [
    'name' => 'Document',
    /*
    |--------------------------------------------------------------------------
    | Мягкое удаление
    |--------------------------------------------------------------------------
    |
    | Позволяет не удалять физически файлы с жесткого диска
    |
    */
    'softDeletes' => env('DOCUMENT_SOFT', true),

    /*
    |--------------------------------------------------------------------------
    | Место хранения записей об документах
    |--------------------------------------------------------------------------
    |
    | Здесь можно определить место хранения для записей об документах.
    | Доступны значения: "database" - база данных, "mongodb" - MongoDb
    |
    */
    'record' => env('DOCUMENT', 'mongodb'),


    /*
    |--------------------------------------------------------------------------
    | Драйвер хранения документов
    |--------------------------------------------------------------------------
    |
    | Определяем систему хранения документов.
    | base - в базе данных, local - локально в папке, ftp - через FTP протокол в папке
    | http - через HTTP протокол в папке
    |
    */
    'driver' => env('DOCUMENT_DRIVER', 'local'),


    /*
    |--------------------------------------------------------------------------
    | Настройка хранилищь для документов
    |--------------------------------------------------------------------------
    |
    | В этом месте можно определить доступы к хранилищу документов
    |
    */
    'store' => [
        'base' => [
            'table' => 'documents',
            'property' => 'byte'
        ],
        'local' => [
            'path' => 'storage/app/public/documents/',
            'pathSource' => storage_path('app/public/documents/'),
        ],
        'ftp' => [
            'server' => 'weborobot.ru',
            'login' => 'weborobot',
            'password' => '',
            'path' => 'www/documents/'
        ],
        'http' => [
            'read' => 'http://loc.weborobot.ru/storage/documents/',
            'create' => 'http://loc.weborobot.ru/doc/create/',
            'update' => 'http://loc.weborobot.ru/doc/update/',
            'destroy' => 'http://loc.weborobot.ru/doc/destroy/',
        ]
    ],
];
